"""Сообщение в виде битовой карты, (c) Эл Свейгарт al@inventwithpython.com
Отображает текстовое сообщение в соответствии с указанной битовой картой.
Код размещен на https://nostarch.com/big-book-small-python-projects
Теги: крошечная, для начинающих, графика"""
import sys

# (!) Попробуйте заменить это многострочное строковое значение на любое
# другое изображение
# Вверху и внизу строки расположено 68 точек:
# (Можете также скопировать и вставить это строковое значение из
# из https://inventwithpython.com/bitmapworld.txt)
bitmap = """
....................................................................
**************
* *** ** *
******************************
********************* ** ** * * ****************************** *
**
*****************
******************************
*************
** * **** ** ************** *
*********
*******
**************** * *
********
*************************** *
*
* **** ***
*************** ****** ** *
**** *
***************
*** *** *
******
*************
**
** *
********
*************
* ** ***
********
********
* *** ****
*********
****** *
**** ** * **
*********
****** * *
*** *
*
******
***** **
*****
*
*****
**** *
********
*****
****
*********
****
**
*******
*
***
*
*
**
*
*
...................................................................."""
print('Bitmap Message, by Al Sweigart al@inventwithpython.com')
print('Enter the message to display with the bitmap.')
message = input('> ')
if message=='':
    sys.exit()

for line in bitmap.splitlines():
    for i,bit in enumerate(line):
        if bit==' ':
            print(' ',end='')
        else:
            print(message[i%len(message)],end='')
    print()